Revit 2024 API
WallSweepInfo Methods
The WallSweepInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Determines if the input object is equivalent to this WallSweepInfo.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace